pulmanturbd/certification6/BookingPriceRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:book="http://services.rccl.com/Interfaces/BookingPrice" xmlns:alp="http://www.opentravel.org/OTA/2003/05/alpha">
<soapenv:Header/>
<soapenv:Body>
  <book:getBookingPrice>
    <OTA_CruisePriceBookingRQ Version="1.0" SequenceNmbr="1" Target="Test" TimeStamp="2008-12-30T18:30:42.720+05:30" xmlns="http://www.opentravel.org/OTA/2003/05/alpha">
      <POS>
        <Source TerminalID="12502LDJW6" ISOCurrency="USD">
            <RequestorID ID="313917" ID_Context="AGENCY1" Type="5"/>
            <BookingChannel Type="7">
            <CompanyName CompanyShortName="PULLMANTUR"/>
            </BookingChannel>
        </Source>
        <Source TerminalID="12502LDJW6" ISOCurrency="USD">
            <RequestorID ID="313917" ID_Context="AGENCY2" Type="5"/>
            <BookingChannel Type="7">
            <CompanyName CompanyShortName="PULLMANTUR"/>
            </BookingChannel>
        </Source>
        <Source TerminalID="12502LDJW6" ISOCurrency="USD">
            <RequestorID ID="313917" ID_Context="AGENT1" Type="5"/>
            <BookingChannel Type="7">
            <CompanyName CompanyShortName="PULLMANTUR"/>
            </BookingChannel>
        </Source>
      </POS>
      <SailingInfo>
        <SelectedSailing Start="2020-08-09">
          <CruiseLine ShipCode="HR" VendorCode="PUL"/>
        </SelectedSailing>
        <InclusivePackageOption CruisePackageCode="HRPT0734" InclusiveIndicator="false"/>
        <SelectedCategory BerthedCategoryCode="FD" FareCode="BESTRATE" PricedCategoryCode="FD">
          <SelectedCabin CabinNumber="6159" Status="36"/>
        </SelectedCategory>
      </SailingInfo>
      <ReservationInfo>
        <GuestDetails>
          <GuestDetail>
            <ContactInfo Age="30"/>
            <GuestTransportation Mode="29" Status="36">
              <GatewayCity LocationCode="C/O"/>
            </GuestTransportation>
            <SelectedDining Sitting="M"/>
            <!--0 to 9 repetitions:-->
            <alp:SelectedInsurance InsuranceCode="TIIR" Status="41"/>
          </GuestDetail>
          <GuestDetail>
            <ContactInfo Age="28"/>
            <GuestTransportation Mode="29" Status="36">
              <GatewayCity LocationCode="C/O"/>
            </GuestTransportation>
            <SelectedDining Sitting="M"/>
            <!--0 to 9 repetitions:-->
            <alp:SelectedInsurance InsuranceCode="TIIR" Status="41"/>
          </GuestDetail>
          <GuestDetail>
            <ContactInfo Age="10"/>
            <GuestTransportation Mode="29" Status="36">
              <GatewayCity LocationCode="C/O"/>
            </GuestTransportation>
            <SelectedDining Sitting="M"/>
            <!--0 to 9 repetitions:-->
            <alp:SelectedInsurance InsuranceCode="TIIR" Status="41"/>
          </GuestDetail>
          <GuestDetail>
            <ContactInfo Age="4"/>
            <GuestTransportation Mode="29" Status="36">
              <GatewayCity LocationCode="C/O"/>
            </GuestTransportation>
            <SelectedDining Sitting="M"/>
            <!--0 to 9 repetitions:-->
            <alp:SelectedInsurance InsuranceCode="TIIR" Status="41"/>
          </GuestDetail>
        </GuestDetails>
      </ReservationInfo>
    </OTA_CruisePriceBookingRQ>
  </book:getBookingPrice>
</soapenv:Body>
</soapenv:Envelope>